# 基础数据类型
# 流程控制 : 条件判断 循环
# 文件操作
# 函数
    # 基础
    # 装饰器
        # 带参数的装饰器 -- 没学
    # 迭代器 生成器
    # 递归函数 -- 没学
# 常用模块
    # random
    # hashlib
    # time datetime
    # collections -- 没学
    # sys
    # os
    # json/pickle
    # re 模块 -- 没学
    # logging模块 --没学
    # 包的导入 -- 没学

# 递归函数 -   1天
# re模块   -   1整天
# logging模块 + 包的导入 +带参数的装饰器 = 1-2天的课
# 面向对象  -  6天
# 网络编程  -  4天
# 并发编程  -  5-6天
# 数据库    -  5天

# 21天 + 3天 = 24天
# 3 +4 +5 + 5 + 2 = 19天

# 进度 -- 26号
# 周六上午再加半天课程


# 吴超 前端 - 第一个django项目结束










